// ===== 主站 SDO 对象配置（自动生成）=====
// 生成时间: 2025-11-29 00:12:38
// 共 10 个对象

static SDO_Object sdo_objects[] = {
    { 0x3000, u8"状态字", 0, "", true }, // 设备1运行状态  设备 1 寄存器 0
    { 0x3001, u8"转速设定", 0, "", true }, // 目标转速  设备 1 寄存器 1
    { 0x3002, u8"实际转速", 0, "", true }, // 当前转速  设备 1 寄存器 2
    { 0x3003, u8"运行电流", 0, "", true }, // 电流反馈  设备 1 寄存器 3
    { 0x3004, u8"阀门开度", 0, "", true }, // 调节阀开度  设备 2 寄存器 16
    { 0x3005, u8"管道压力", 0, "", true }, // 压力值  设备 2 寄存器 1
    { 0x3006, u8"环境温度", 0, "", true }, // 温度传感器  设备 3 寄存器 2
    { 0x3007, u8"故障代码", 0, "", true }, // 报警信息  设备 1 寄存器 5
    { 0x3008, u8"运行时间高", 0, "", true }, // 累计运行时间高16位  设备 1 寄存器 4
    { 0x3009, u8"运行时间低", 0, "", true } // 累计运行时间低16位  设备 1 寄存器 9
};

static const int sdo_count = 10;

// ==============================================